[
{"title": "Farm Energy & Agriculture Engineering Specialist", "location": "Amherst, MA", "description": "Full-time position combines roles within the UMass Clean Energy Extension & UMass Extension Agriculture Program, and will focus on providing energy efficiency consulting, agricultural engineering expertise, and technical support to Massachusetts farmers. Key qualifications include agricultural energy & engineering experience, strong energy assessment capabilities, excellent communication skills."},
{"title": "Data and Operations Systems Manager", "location": "Somerville, MA", "description": "Paradigm Energy Services is hiring a Data and Operations Systems Manager to drive efficiency, integrate data systems, and develop insights that enhance our impact. This role involves optimizing workflows, building scalable tools, and collaborating across teams to support business strategies. Ideal candidates have experience in data management, automation, and AI-driven solutions. Join our innovative team and help shape a smarter, data-driven future!"},
{"title": "Field Representative", "location": "Somerville, MA", "description": "The Field Representative at Paradigm Energy Services plays a crucial role in overseeing energy efficiency projects across Massachusetts, serving as the on-the-ground liaison between internal teams, subcontractors, and customers."},
{"title": "Director, Data Analytics", "location": "New York, NY", "description": "On behalf of DEM, CUNY BPL seeks to hire a Director of Data Analytics to help reduce emissions and energy consumption across the City by leading DEM’s data analytics practice with an emphasis on GHG performance analysis and forecasting, business decision support, and strategy development."},
{"title": "Building Decarbonization Code Specialist", "location": "Boston, MA", "description": "The Department of Energy Resources’ (DOER) Energy Efficiency Division is seeking a Building Decarbonization Code Specialist to provide support on the Commonwealth’s recently updated building energy codes, efforts to improve decarbonization outcomes of these codes, and implementation of U.S. Department of Energy-funded code decarbonization programs and research."},
{"title": "Energy Raters - Upstate NY & Central Mass", "location": "Multiple Locations in NY & MA", "description": "The Energy Rater ensures that multifamily construction projects meet the highest standards of energy efficiency and green building certification programs. This role involves on-site inspections, diagnostic testing, and collaboration with project teams to identify areas for improvement and maintain compliance with standards like HERS, ENERGY STAR, LEED, and more."},
{"title": "Associate Project Manager, Capital Project Implementation", "location": "New York City, NY", "description": "The Associate Project Manager will work in DEM’s Operations Unit, under the guidance of a Senior Program Manager, but in close coordination with DEM’s other units. The Associate Project Manager will be charged with responsibilities including, but not limited to:\n1) Assist in energy efficiency project scoping.\n2) Support the Management of Energy Efficiency Projects.\n3) Conduct Basic Technical Calculations.\n4) Participate in Site Visits.\nPlease see details for a full description."},
{"title": "Senior Energy Analyst", "location": "Ithaca, NY", "description": "Taitem Engineering is hiring a senior-level engineer, sustainability consultant, or energy analyst with at least eight years of experience. Come lead a variety of projects relating to analysis of energy retrofits and electrification in existing buildings and new construction high-performance buildings. This is a great opportunity to use your experience to support our work on contracts that require technical expertise."}
]